app/controllers/gamers_controller.rb

SELECT "gamers".* FROM "gamers"
---
  def index
    @gamers = Gamer.all

INSERT INTO "gamers" ("name", "game", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Geraldy"], ["game", "tekken 7"], ["created_at", "2018-05-25 10:48:42.762701"], ["updated_at", "2018-05-25 10:48:42.762701"]]
---
  def create
    @gamer = Gamer.new(gamer_params)

    respond_to do |format|
      if @gamer.save

UPDATE "gamers" SET "name" = ?, "game" = ?, "updated_at" = ? WHERE "gamers"."id" = ?  [["name", "rubeboy"], ["game", "tekken 7"], ["updated_at", "2018-05-25 18:23:22.235641"], ["id", 14]]
---
  def update
    respond_to do |format|
      if @gamer.update(gamer_params)

DELETE FROM "gamers" WHERE "gamers"."id" = ?  [["id", 2]]
---
  def destroy
    @gamer.destroy

SELECT  "gamers".* FROM "gamers" WHERE "gamers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_gamer
      @gamer = Gamer.find(params[:id])