app/views/gamers/destroy.js.erb

$('.delete_gamer').bind('ajax:success', function() {
   $(this).closest('tr').fadeOut();
});
---
DELETE FROM "gamers" WHERE "gamers"."id" = ?  [["id", 2]]